app/linAdvEuler/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField nonuniform List<scalar>
270
(
0.58072
0.58072
0.58072
0.58072
0.58072
0.58072
0.58072
0.58072
...
)
;

boundaryField
{
    inlet
    {
        type 		zeroGradient;
    }
    outlet
    {
        type 		zeroGradient;
    }
    sides
    {
        type 		zeroGradient;
    }
}


// ************************************************************************* //
